package cloud.common.enums;

public enum ResCode {

	成功("0000"),
	失败("0001"),

	请求参数验证不通过("0002"),
	token或ticket过期("0003"),
	查询第三方接口失败("0004"),
	未找到订单信息("0005"),
	无权限访问("0006"),
	签名验证不通过("0007"),
	签名或验签异常("0008"),
	商户未注册或未激活("0009"),
	未生成证书("0010"),
	处理中("0011"),
	需要用户输入支付密码("0012"),
	没有可用的支付渠道和商户("0013"),
	不能重复撤销订单("0014"),
	不能重复退款("0015"),
	退款总金额大余订单金额("0016"),
	订单不能重复("0017"),
	订单已支付或已退款不能关闭("0018"),
	不能重复关闭订单("0019"),
	查询第三方接口未返回有效信息("0020"),
	支付成功的订单不能撤销("0022"),
	未知的支付渠道和商户("0021"),
	调用第三方接口失败("0023"),
	调用第三方接口未返回有效信息("0024"),
	余额不足("0025"),
	组装第三方请求参数异常且未发起请求("0026"),
	解析第三方返回参数异常已完成请求("0027"),
	系统异常("9999");
	
	
	private final String value;
	

	private ResCode(String value) {
		this.value = value;
	}
	public String value() {
		return this.value;
	}
	
	public String toString() {
		return this.value.toString();
	}
}
